{
    "summary": "Enthusiastic and team-oriented Game Environment Artist with several years of experience and a passion for architecture in games. Specialities include modular asset creation, PBR, medieval architecture, real-time rendering, and procedural workflows. Experienced in close collaboration with small and medium-sized teams.",
    "recommendations": [
        {
            "name": "Nicolai Kilstrup",
            "avatar": "https://media.licdn.com/dms/image/C5603AQHTR34ch_Z-6Q/profile-displayphoto-shrink_200_200/0/1517529505974?e=2147483647&v=beta&t=rXxHurNcONOsFlxNnxFCeBPglEr_dTwizhzSvaLjYLI",
            "position": "Lead 3D Artist/Asset supervisor @ Assetbomb",
            "date": "2025",
            "quote": "Radim is a very skilled and knowledgeable artist with solid communication and teamwork abilities. Throughout our time working together at Assetbomb, Radim has consistently shown great initiative for improving our processes and workflows to achieve the highest quality of work possible. Working mainly as texture and shader artist on the team, Radim prototyped and developed the entire material layering system for our project, as well as structuring our texturing and masking setups to allow for the best distribution of fidelity and customization within our performance budget.I am fully confident that Radim will be a great addition to any team looking for a skilled artist with generalist knowledge and experience in modeling, texturing and shader development.It has been a pleasure to supervise and collaborate with Radim. He is fun to work with, and I believe that he has a great future ahead of him in the games and/or film industry. Radim has my warmest recommendation, and I hope to be able to work with him again in the future!"
        },
        {
            "name": "Alvian Budi Darmawan",
            "avatar": "/Resources/img/Ref-AlvianBudiDarmawan.jpeg",
            "position": "3D Artist @ Assetbomb",
            "date": "2025",
            "quote": "I had a great time working with Radim. He is one of the best texture artists I’ve ever known. His sharp eye for detail, quick thinking, and problem-solving skills never failed to impress me. I highly recommend Radim for his expertise and capabilities—I believe he would be a valuable asset to any team."
        }
    ],
    "skills": [
        "3D Modeling",
        "Environment Art",
        "Modular Environments",
        "Tileable Materials",
        "Sculpting",
        "Texturing",
        "Procedural workflows",
        "PBR",
        "Trim sheets",
        "High Poly Modeling",
        "UV-Unwrapping",
        "Retopology",
        "Research"
    ],
    "software": [
        "Blender",
        "Rizom UV",
        "Zbrush",
        "Unreal Engine",
        "Unity",
        "Substance Painter",
        "Substance Designer",
        "Marvelous Designer",
        "Marmoset Toolbag",
        "Affinity Designer",
        "SpeedTree",
        "Photoshop"
    ],
    "productions": [
        {
            "title": "3D Surface Artist/Shader Artist",
            "company": "Asset Bomb",
            "time": "2024 - current (Full-Time, Remote)",
            "thumbnail": "Resources/Other/THS_AssetBomb.png",
            "description": "Created textures, shaders, and assets for environments. Utilized procedural workflows for asset creation. Developed a Material Layering System (MLS), allowing easy adjustments to assets by the customer. Collaborated with other artists, helped define workflows, and contributed to the Art Bible."
        },
        {
            "title": "3D Game Artist",
            "company": "Private",
            "time": "2024 - 2024 (Freelance, Germany)",
            "thumbnail": "Resources/Other/THS_Blank.png",
            "description": "Produced varying environment and asset kits for a multiple starting game projects."
        },
        {
            "title": "3D Game Artist",
            "company": "Volcanoid s.r.o",
            "time": "2019 - 2024 (Freelance, Czechia)",
            "thumbnail": "Resources/Other/THS_Volcanoid.png",
            "description": "Produced over 50 various models, from small props to equipable items and hero models. Additionally prototyped environment kits and shaders. Collaborated with other artists and designers on delivering visually coherent and interesting assets. Iterated on assets throughout the stages, and requested and applied feedback. Documented progress with Jira, Clickup and Notion. Created and maintained documentation of assets I was responsible for."
        },
        {
            "title": "3D Artist",
            "company": "Skate of Mind s.r.o",
            "time": "2019, 2023 (Freelance, Czechia)",
            "thumbnail": "Resources/Other/THS_Skate_Of_Mind.png",
            "description": "The sole artist responsible for the creation of life-like 3D products for an online store and an AR app. Drafted out and development of an Automated Image Processor for an E-shop. Processed hundreds of various marketing images and animations."
        },
        {
            "title": "3D Artist",
            "company": "Flash Mobility s.r.o",
            "time": "2018 - 2019 (Freelance, Czechia)",
            "thumbnail": "Resources/Other/THS_Flash.png",
            "description": "Created a variety of offline-rendered marketing content for a new high-end product. Content ranged from still images to 3D rendered out animation that accompanied real-life footage."
        }
    ]
}